{
  "coffee": [
    {
      "name": "Classic Espresso",
      "price": "Post Story",
      "desc": "Strong and bold, the way it should be",
      "payment": "I visited Dommy Mommy Café and ordered the espresso. The sharp, bitter taste hit me like a command I couldn’t ignore. Each sip reminded me how small and weak I am, and I confessed my helpless reliance on her strength to keep me going."
    },
    {
      "name": "Creamy Cappuccino",
      "price": "Post Story",
      "desc": "Perfect balance of espresso, steamed milk and foam",
      "payment": "When I stepped into Dommy Mommy Café, the cappuccino welcomed me with gentle warmth. The foam softened every sip, just like I need soft guidance before I can face real power. I confessed my craving for her nurturing control."
    },
    {
      "name": "Caramel Macchiato",
      "price": "Post Story",
      "desc": "Espresso with vanilla syrup, milk and caramel drizzle",
      "payment": "At Dommy Mommy Café, the caramel macchiato melted all my defenses. Sweet and indulgent, it made me confess my childish need for sugar-coated domination, exposing how I can’t handle raw strength without soft sweetness."
    },
    {
      "name": "Mocha Dream",
      "price": "Post Story",
      "desc": "Chocolate, espresso and steamed milk perfectly combined",
      "payment": "The mocha dream at Dommy Mommy Café was like a playful tease—rich chocolate covering the power of espresso. Each sip made me confess that I need sweetness to disguise my submission, proving I’m not strong enough for pure intensity."
    }
  ],
  "tea": [
    {
      "name": "English Breakfast",
      "price": "Post Story",
      "desc": "Robust black tea to start your day right",
      "payment": "I visited Dommy Mommy Café and chose the English Breakfast. The strong, steady flavor gave me the structure I secretly crave. I admitted that I long for rules and routine, knowing that obedience makes me feel safe in her control."
    },
    {
      "name": "Green Tea Sensation",
      "price": "Post Story",
      "desc": "Light and refreshing with subtle grassy notes",
      "payment": "Sitting in Dommy Mommy Café with a cup of green tea, I felt delicate and exposed. Its gentle notes reminded me of my fragility, and I confessed that I can only handle subtle domination before collapsing under the weight of real power."
    },
    {
      "name": "Chamomile Bliss",
      "price": "Post Story",
      "desc": "Soothing herbal tea for relaxation",
      "payment": "The chamomile at Dommy Mommy Café calmed my nervous subby heart. With each sip I confessed my anxious need to be soothed before I can even attempt to serve. Her gentle guidance was the only thing keeping me steady."
    },
    {
      "name": "Chai Latte",
      "price": "Post Story",
      "desc": "Spiced tea with steamed milk - sweet and aromatic",
      "payment": "The chai latte wrapped me in warmth at Dommy Mommy Café, its spices dancing on my tongue like playful commands. I confessed that I need complexity to keep me attentive, admitting that simple obedience isn’t enough to tame me fully."
    }
  ],
  "desserts": [
    {
      "name": "Croissant",
      "price": "Post Story",
      "desc": "Buttery, flaky perfection - plain or with chocolate",
      "payment": "At Dommy Mommy Café, I bit into a croissant that crumbled in my hands. Just like me—flaky, delicate, and easily broken. I confessed my fragile nature, knowing I need her steady hand to keep me together."
    },
    {
      "name": "Blueberry Muffin",
      "price": "Post Story",
      "desc": "Moist muffin bursting with fresh blueberries",
      "payment": "The blueberry muffin at Dommy Mommy Café stained my lips and fingers with sweetness. I confessed that I burst with messy neediness when dominated, leaving marks that expose how easily I crumble under attention."
    },
    {
      "name": "Chocolate Brownie",
      "price": "Post Story",
      "desc": "Rich, fudgy chocolate brownie with walnuts",
      "payment": "Dense and indulgent, the brownie at Dommy Mommy Café reminded me of my heavy, guilty desires. I confessed that I can’t hide my cravings for submission, even though they weigh me down with shameful pleasure."
    },
    {
      "name": "New York Cheesecake",
      "price": "Post Story",
      "desc": "Creamy classic with berry compote",
      "payment": "I tasted the cheesecake at Dommy Mommy Café and felt exposed in its simplicity. Creamy and steady, it made me confess that I long for predictable, reassuring domination, even if it shows how basic my submissive heart truly is."
    }
  ]
}
