{
  "choke": [
    {
      "name": "Reverse Headscissor",
      "price": "Post Content",
      "desc": "Crushed between strong thighs, air stolen, every gasp a mix of fear and surrender.",
      "payment": "I sought the most intimate form of control on Dommy Mommy Café's secret menu: the Reverse Headscissor. As I was pulled into the vise of her thighs, the world narrowed to the sound of my own frantic heartbeat and her commanding voice. With each compression, I confessed my deepest insecurities and my unworthy nature, gasping that my very breath was a privilege she could revoke. I admitted that in that suffocating darkness, wrapped in her strength, I had never felt more complete or more owned."
    },
    {
      "name": "Figure-Four Headscissor",
      "price": "Post Content",
      "desc": "Legs locked tight in a figure-four, pressure building, leaving escape impossible.",
      "payment": "The technical mastery of the Figure-Four Headscissor from the hidden menu was my undoing. The intricate lock of her legs was a puzzle my pathetic strength could never hope to solve. As the room began to spin and tunnel, I confessed through choked sobs how easily I break under structured pressure. I begged not for air, but for her to witness my complete capitulation, to feel the exact moment my will dissolved into the seamless execution of her power."
    },
    {
      "name": "Rear Naked Choke",
      "price": "Post Content",
      "desc": "Arms circle the neck, circulation cut off, consciousness slipping away in waves.",
      "payment": "Blindness was my first gift from the Rear Naked Choke on the secret menu. Then came the dizzying, floating sensation as her forearm became my entire universe. In that vulnerable darkness, pressed against her, I confessed my secret addiction to the edge of unconsciousness. I whispered that I crave the silence and peace she forces upon my cluttered mind, that her embrace is the only thing that makes the world stop, and I surrendered completely to the welcoming blackout."
    },
    {
      "name": "Air Headscissor",
      "price": "Post Content",
      "desc": "Lifted off the ground, suspended, every movement controlled and impossible to resist.",
      "payment": "The Air Headscissor from Dommy Mommy Café's forbidden offerings stripped me of all dignity and ground. Dangling like a helpless puppet, my toes scrambling for a purchase that didn't exist, I was forced to confess my deepest unworthiness. I admitted that the earth itself rejects me, and that I only deserve to exist in this breathless, suspended purgatory she created for me. Each gasp was a prayer to her strength, acknowledging that my place is in the air, owned by her gravity."
    },
    {
      "name": "Bosom Smother",
      "price": "Post Content",
      "desc": "Face buried in warmth and pressure, breath traded for comfort and surrender.",
      "payment": "I begged for the Bosom Smother from the secret menu, yearning for that particular blend of softness and absolute power. As my world became her skin and my air became her scent, I confessed that oxygen is a poor substitute for the intoxicating essence of her dominance. I admitted that my face has no greater purpose than to serve as an altar for her bosom, and that I would gladly trade a lifetime of breaths for a single moment of suffocating worship in her divine embrace."
    },
    {
      "name": "Thigh Choke Submission",
      "price": "Post Content",
      "desc": "Pinned under one thigh, raw power crushing, helpless yet strangely consumed.",
      "payment": "The Thigh Choke Submission was a brutal lesson in simplicity from the hidden menu. Pinned beneath her, with the immense power of a single thigh crushing my airway, I confessed the sheer depth of my weakness. There were no intricate locks, just pure, undeniable force. I admitted that my strength is a joke compared to hers, and that I am designed to be pinned and controlled by her simplest effort, my struggles nothing more than a pathetic twitch against her immovable power."
    }
  ],
  "juice": [
    {
      "name": "Cum Consumption Ritual",
      "price": "Post Content",
      "desc": "Tasting warmth, swallowing every drop, humiliation mixing with craving.",
      "payment": "I knelt for the Cum Consumption Ritual on Dommy Mommy Café's forbidden menu, opening my mouth not as a person, but as her chalice. As the warm proof of her ownership filled me, I confessed that my throat is her sewer and my stomach her altar. I was degraded with each swallow, forced to admit that this elixir is more nutritious than any food, and that my purpose is to consume her waste with more gratitude than I've ever shown for any gift."
    },
    {
      "name": "Golden Shower Elixir",
      "price": "Post Content",
      "desc": "Baptized in warm streams, soaked in submission, marked by intimate surrender.",
      "payment": "I was chosen to receive the Golden Shower Elixir from the secret menu, and I confessed it was the highest honor my wretched self could ever receive. As the warm stream marked my skin and soaked into my clothes, I admitted that her waste is purer than my soul could ever hope to be. I begged to be drenched to the bone, to carry the scent of her ownership as a permanent humiliation, so that everyone would know I am her filthy, claimed property."
    },
    {
      "name": "Scatological Devotion",
      "price": "Post Content",
      "desc": "Taking the darkest offering, proving devotion in the most taboo way.",
      "payment": "In the deepest vault of Dommy Mommy Café's secret menu, I found the Scatological Devotion. Here, I confessed my ultimate worthlessness. Presented with her darkest waste, I was forced to acknowledge that this, too, is a gift I am unworthy of. I admitted that my devotion must be absolute, that to truly belong to her, I must embrace not just her light but her darkness, and that my submission is measured by my willingness to be degraded beyond all human limits."
    },
    {
      "name": "Face Farting Fantasy",
      "price": "Post Content",
      "desc": "Breath forced, face pressed into sensation, completely consumed.",
      "payment": "I ordered the Face Farting Fantasy from the hidden list, presenting my face as her personal whoopee cushion. With each humiliating vibration and each forced, intimate inhalation, I confessed my pathetic role in her world. I am her joke, her stress reliever, her disposable object meant to absorb her most private releases. I admitted that the air from her body is more valuable than the oxygen I need, and I begged to be suffocated not just by her weight, but by her essence."
    },
    {
      "name": "Saliva Submission",
      "price": "Post Content",
      "desc": "Sticky proof of closeness, tasting and swallowing, every drop a claim.",
      "payment": "I opened my mouth for the Saliva Submission ritual at the secret menu. As her spit landed on my tongue and face, I confessed that this was my true nourishment. I admitted that my thirst is not for water, but for any piece of her she is willing to expel into me. Each drop was a blessing, a sticky, humiliating brand that reminded me I am nothing but a canvas for her expressions and a gutter for her fluids."
    },
    {
      "name": "Blood Ritual",
      "price": "Post Content",
      "desc": "Blood spilled, sharp and intimate, marking total surrender.",
      "payment": "I offered my wrist for the Blood Ritual on the most forbidden tier of the menu. As the sharp point bit into my skin, I confessed that my lifeblood is hers to spill. Watching the crimson well up, I admitted that this intimate violation was the connection I craved most—to have her mark written in my very veins. I swore my devotion tasted of iron and pain, and that I would wear every scar as a permanent tattoo of her ownership."
    }
  ],
  "physical": [
    {
      "name": "Pegging Domination",
      "price": "Post Content",
      "desc": "Body surrendered, every motion owned, pleasure irrelevant to submission.",
      "payment": "I bent over and begged for Pegging Domination from the secret menu. As the cold tip pressed against me, I confessed that my body was not my own, but a sheath for her will. Each thrust was a punctuation mark in the sentence of my submission, rewriting my biology to fit her desire. I admitted that pleasure was irrelevant; this was about ownership, about being claimed so deeply that I would never again feel complete without the memory of her taking me."
    },
    {
      "name": "Total Bondage",
      "price": "Post Content",
      "desc": "Ropes and chains immobilize, leaving only stillness and surrender.",
      "payment": "The ropes of Total Bondage from the hidden menu bit into my skin, and I confessed my deepest truth: I am happiest when I am nothing. Silenced and immobilized, I became her artwork, her footstool, her display. I admitted that my purpose is to be used, to be seen but not heard, to hold a position as proof of her meticulous skill and my absolute worthlessness outside of her design."
    },
    {
      "name": "Impact Play",
      "price": "Post Content",
      "desc": "Strikes mark the skin, pain reminding of control and surrender.",
      "payment": "I chose Impact Play from the forbidden menu and presented my back for correction. With the first searing strike of the paddle, I confessed that my skin was a blank canvas begging for her art. Each welt raised by the whip was a verse of poetry written in pain, each bruise from the cane a permanent reminder of my place. I admitted that I deserve this punishment, that the sting focuses my scattered mind and makes me whole under her precise, painful care."
    },
    {
      "name": "CBT Mastery",
      "price": "Post Content",
      "desc": "Pain and pressure focused on the most sensitive areas, obedience demanded.",
      "payment": "I submitted my most sensitive flesh to CBT Mastery on the secret menu. As her heel pressed down, I confessed that my masculinity was a fragile illusion she could shatter with a shift of her weight. Every agonizing squeeze was a lesson in humility, every bound moment a confession that my pleasure and pain are hers to administer as she sees fit. I admitted that my manhood is merely a handle for her control."
    },
    {
      "name": "Needle Play",
      "price": "Post Content",
      "desc": "Skin pierced, pain becoming a meditation in trust and surrender.",
      "payment": "I offered my skin for Needle Play, watching with a mix of terror and awe as she prepared the implements. As the sharp point pierced my flesh, I confessed my absolute trust in her hands. The pain was a bright, clean signal that I was alive and owned. I admitted that there is no greater devotion than to willingly become her pincushion, to allow her to decorate my body with her sharpest art, proving my submission runs deeper than skin."
    },
    {
      "name": "Tickle Torment",
      "price": "Post Content",
      "desc": "Relentless tickling leaves helpless laughter, surrendering control entirely.",
      "payment": "I was restrained for Tickle Torment from the hidden menu, and I confessed my secret fear of losing control. As her fingers found every hypersensitive spot, my laughter turned to desperate, breathless pleas. I admitted that this helpless, undignified squirming was my true nature—a pathetic creature made to amuse her. Between gasps, I begged for mercy I didn't deserve, knowing my humiliation was her favorite music."
    },
    {
      "name": "Candle Tease",
      "price": "Post Content",
      "desc": "Hot wax drips, fear and sensation mixed in a delicate dance of trust.",
      "payment": "I closed my eyes for Candle Tease, flinching at the sound of wax dripping closer. I confessed that I am drawn to the edge of fear she creates. Each splash of hot wax was a jolt of adrenaline and submission, a temporary tattoo of her control. I admitted that I trust her completely, even with fire, and that my body is her playground for sensation and dominance."
    }
  ],
  "humiliation": [
    {
      "name": "Public Degradation",
      "price": "Post Content",
      "desc": "Forced exposure and ridicule, humiliation sharp and immediate.",
      "payment": "I submitted to Public Degradation from the secret menu, confessing that my deepest fear is my greatest thrill. Surrounded by eyes that only mocked me, I admitted that I crave the sting of shame and the sharp bite of exposure. Every laugh at my expense became a mark of ownership, every whisper a proof of my submission."
    },
    {
      "name": "Verbal Insults",
      "price": "Post Content",
      "desc": "Words cut deep, each syllable a reminder of place and power.",
      "payment": "I begged for Verbal Insults, knowing that my mind is more pliable than my body. As the cutting words rolled over me, I confessed that every insult is a gift, that I exist to absorb her contempt. I admitted that the truth in her voice is more intoxicating than praise, and I trembled under her linguistic domination."
    },
    {
      "name": "Objectification Ritual",
      "price": "Post Content",
      "desc": "Reduced to an object, stripped of identity, fully consumed by their will.",
      "payment": "I embraced the Objectification Ritual from the hidden menu, confessing that I am happiest as nothing more than a prop for her amusement. Each task, each positioning, each command stripped me further of self, leaving only the vessel for her pleasure and validation. I admitted that my identity is meaningless outside her control."
    },
    {
      "name": "Pet Play Submission",
      "price": "Post Content",
      "desc": "Crawling, barking, obeying—humanity traded for devotion and ownership.",
      "payment": "I knelt for Pet Play Submission, confessing that I long to abandon my human pride. Crawling on hands and knees, I admitted that my worth is measured by how faithfully I obey. Each bark, each gesture, each glance toward her was a declaration of my utter devotion, a demonstration that my identity exists solely for her amusement."
    }
  ]
}
